/*Потребно е да се напише програма во С програмскиот јазик од која може да се креираат повеќе процеси.
Програмата како аргумент од командна линија добива име на датотека (во која има текст) која треба да
ја мапира во сопствениот адресен простор со помош на mmap. Мапираната датотека смее да ја користи
еден процес едновремено, притоа треба да се направи механизам за меѓусебно исклучување на
процесите и пристап до мапираната меморија. Процесите треба да ја испишат на екран содржината на
мапираната меморија на тој начин што процесот што ќе добие пристап до меморијата, генерира случаен
број Х во опсег од 10 до 100 (со помош на rand()%90 + 10). Печати Х знаци од датотеката, ја ослободува
меморијата да ја користи некој друг процес и заспива 2 секунди и потоа се обидува пак да прочита од
меморијата. Ова процесите го прават додека се испише содржината на целата датотека на екран. Да се
земе во предвид дека датотеката може да има најмногу 1000 знаци. Потребно е да се реализира:
• Синхронизација на процесите до заедничката меморија да може едновремено да
пристапи само еден процес
• Да знаат процесите до каде е прочитано од меморијата (од страна на процесите) за да
знае од каде да продолжи да чита и печати на екран
• Кога еден процес ќе ја прочита содржината на целата датотека, другите процеси да знаат
дека е прочитана целата датотека и да прекинат со извршување
*/